In [1]:
import pandas as pd
from sqlalchemy import create_engine
import psycopg2

In [2]:
#Store Coursera Data CSV into DataFrame
csv_file1coursera = "coursea_data.csv"
coursera_df = pd.read_csv(csv_file1coursera)
coursera_df.head()

,Unnamed: 0,course_title,course_organization,course_Certificate_type,course_rating,course_difficulty,course_students_enrolled
0,134,(ISC)² Systems Security Certified Practitioner...,(ISC)²,SPECIALIZATION,4.7,Beginner,5.3k
1,743,A Crash Course in Causality: Inferring Causal...,University of Pennsylvania,COURSE,4.7,Intermediate,17k
2,874,A Crash Course in Data Science,Johns Hopkins University,COURSE,4.5,Mixed,130k
3,413,A Law Student's Toolkit,Yale University,COURSE,4.7,Mixed,91k
4,635,A Life of Happiness and Fulfillment,Indian School of Business,COURSE,4.8,Mixed,320k

In [3]:
coursera_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
Unnamed: 0                  891 non-null int64
course_title                891 non-null object
course_organization         891 non-null object
course_Certificate_type     891 non-null object
course_rating               891 non-null float64
course_difficulty           891 non-null object
course_students_enrolled    891 non-null object
dtypes: float64(1), int64(1), object(5)
memory usage: 48.9+ KB

In [4]:
#Store Udemy Data CSV into DataFrame
csv_file2udemy = "udemy_courses.csv"
udemy_df = pd.read_csv(csv_file2udemy)
udemy_df.head()

,course_id,course_title,url,is_paid,price,num_subscribers,num_reviews,num_lectures,level,content_duration,published_timestamp,subject
0,1070968,Ultimate Investment Banking Course,https://www.udemy.com/ultimate-investment-bank...,True,200,2147,23,51,All Levels,1.5,2017-01-18T20:58:58Z,Business Finance
1,1113822,Complete GST Course & Certification - Grow You...,https://www.udemy.com/goods-and-services-tax/,True,75,2792,923,274,All Levels,39.0,2017-03-09T16:34:20Z,Business Finance
2,1006314,Financial Modeling for Business Analysts and C...,https://www.udemy.com/financial-modeling-for-b...,True,45,2174,74,51,Intermediate Level,2.5,2016-12-19T19:26:30Z,Business Finance
3,1210588,Beginner to Pro - Financial Analysis in Excel ...,https://www.udemy.com/complete-excel-finance-c...,True,95,2451,11,36,All Levels,3.0,2017-05-30T20:07:24Z,Business Finance
4,1011058,How To Maximize Your Profits Trading Options,https://www.udemy.com/how-to-maximize-your-pro...,True,200,1276,45,26,Intermediate Level,2.0,2016-12-13T14:57:18Z,Business Finance

In [5]:
udemy_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3678 entries, 0 to 3677
Data columns (total 12 columns):
course_id              3678 non-null int64
course_title           3678 non-null object
url                    3678 non-null object
is_paid                3678 non-null bool
price                  3678 non-null int64
num_subscribers        3678 non-null int64
num_reviews            3678 non-null int64
num_lectures           3678 non-null int64
level                  3678 non-null object
content_duration       3678 non-null float64
published_timestamp    3678 non-null object
subject                3678 non-null object
dtypes: bool(1), float64(1), int64(5), object(5)
memory usage: 319.8+ KB

In [6]:
#dropping irrelevant columns
udemy_df.drop(columns=['url','price','num_lectures','published_timestamp'], axis=1, inplace=True)

In [7]:
udemy_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3678 entries, 0 to 3677
Data columns (total 8 columns):
course_id           3678 non-null int64
course_title        3678 non-null object
is_paid             3678 non-null bool
num_subscribers     3678 non-null int64
num_reviews         3678 non-null int64
level               3678 non-null object
content_duration    3678 non-null float64
subject             3678 non-null object
dtypes: bool(1), float64(1), int64(3), object(3)
memory usage: 204.9+ KB

In [8]:
udemy_df.drop(columns=['content_duration'], axis=1, inplace=True)

In [9]:
udemy_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3678 entries, 0 to 3677
Data columns (total 7 columns):
course_id          3678 non-null int64
course_title       3678 non-null object
is_paid            3678 non-null bool
num_subscribers    3678 non-null int64
num_reviews        3678 non-null int64
level              3678 non-null object
subject            3678 non-null object
dtypes: bool(1), int64(3), object(3)
memory usage: 176.1+ KB

In [10]:
#renaming columns to match coursera dataframe
udemy_df.rename(columns={'num_reviews': 'course_rating', 'level': 'course_difficulty','num_subscribers':'course_students_enrolled'}, inplace=True)

In [11]:
udemy_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3678 entries, 0 to 3677
Data columns (total 7 columns):
course_id                   3678 non-null int64
course_title                3678 non-null object
is_paid                     3678 non-null bool
course_students_enrolled    3678 non-null int64
course_rating               3678 non-null int64
course_difficulty           3678 non-null object
subject                     3678 non-null object
dtypes: bool(1), int64(3), object(3)
memory usage: 176.1+ KB

In [12]:
coursera_df.rename(columns={'Unnamed: 0': 'course_id'}, inplace=True)

In [13]:
udemy_df.drop(columns=['is_paid','subject'], axis=1, inplace=True)

In [14]:
udemy_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3678 entries, 0 to 3677
Data columns (total 5 columns):
course_id                   3678 non-null int64
course_title                3678 non-null object
course_students_enrolled    3678 non-null int64
course_rating               3678 non-null int64
course_difficulty           3678 non-null object
dtypes: int64(3), object(2)
memory usage: 143.8+ KB

In [15]:
#dropping irrelevant columns
coursera_df.drop(columns=['course_organization','course_Certificate_type'], axis=1, inplace=True)

In [16]:
coursera_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
course_id                   891 non-null int64
course_title                891 non-null object
course_rating               891 non-null float64
course_difficulty           891 non-null object
course_students_enrolled    891 non-null object
dtypes: float64(1), int64(1), object(3)
memory usage: 34.9+ KB

In [17]:
#converting values of 91k to 91000
coursera_df['course_students_enrolled']=coursera_df['course_students_enrolled'].replace({'k': '*1e3', 'm': '*1e6'}, regex=True).map(pd.eval)

In [18]:
coursera_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
course_id                   891 non-null int64
course_title                891 non-null object
course_rating               891 non-null float64
course_difficulty           891 non-null object
course_students_enrolled    891 non-null float64
dtypes: float64(2), int64(1), object(2)
memory usage: 34.9+ KB

In [19]:
udemy_df['course_students_enrolled'] = udemy_df['course_students_enrolled'].astype(float)

In [20]:
udemy_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3678 entries, 0 to 3677
Data columns (total 5 columns):
course_id                   3678 non-null int64
course_title                3678 non-null object
course_students_enrolled    3678 non-null float64
course_rating               3678 non-null int64
course_difficulty           3678 non-null object
dtypes: float64(1), int64(2), object(2)
memory usage: 143.8+ KB

In [21]:
#changing dtype
udemy_df['course_rating'] = udemy_df['course_rating'].astype(float)

In [22]:
udemy_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3678 entries, 0 to 3677
Data columns (total 5 columns):
course_id                   3678 non-null int64
course_title                3678 non-null object
course_students_enrolled    3678 non-null float64
course_rating               3678 non-null float64
course_difficulty           3678 non-null object
dtypes: float64(2), int64(1), object(2)
memory usage: 143.8+ KB

In [23]:
#randomly selecting records to create dataframe with equivalent records
udemy_df=udemy_df.sample(n = 891)

In [24]:
udemy_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 497 to 161
Data columns (total 5 columns):
course_id                   891 non-null int64
course_title                891 non-null object
course_students_enrolled    891 non-null float64
course_rating               891 non-null float64
course_difficulty           891 non-null object
dtypes: float64(2), int64(1), object(2)
memory usage: 41.8+ KB

In [25]:
#replacing values
udemy_df["course_difficulty"].replace({"All Levels": "Mixed", "Beginner Level": "Beginner","Intermediate Level": "Intermediate","Expert Level": "Advanced"}, inplace=True)

In [26]:
udemy_df.head()

,course_id,course_title,course_students_enrolled,course_rating,course_difficulty
497,706670,FOREX : Learn Technical Analysis,1199.0,37.0,Mixed
3317,1246622,Build and Deploy a LAMP server on AWS,3571.0,18.0,Beginner
2984,795278,"Build Ajax Web Apps with Laravel 5.2, Bootstra...",1023.0,131.0,Mixed
1855,646906,Playing Piano: Play Chords and Popular Pieces...,1987.0,7.0,Beginner
1879,759972,150 Rock Guitar Licks You MUST Know,252.0,14.0,Mixed

In [27]:
udemy_df.course_difficulty.value_counts()

Mixed           469
Beginner        317
Intermediate     88
Advanced         17
Name: course_difficulty, dtype: int64

In [28]:
coursera_df.course_difficulty.value_counts()

Beginner        487
Intermediate    198
Mixed           187
Advanced         19
Name: course_difficulty, dtype: int64

In [29]:
#connecting to postgres
engine = create_engine('postgres://postgres:PASSWORD@localhost:5432/divyapuraswani')
conn = engine.connect()

In [30]:
#verify tables
engine.table_names()

['udemy', 'coursera']

In [31]:
#dataframe to sql
udemy_df.to_sql(name='udemy', con=engine, if_exists='append', index=False)

In [32]:
pd.read_sql_query('select * from udemy', con=engine).head()

,course_id,course_title,course_students_enrolled,course_rating,course_difficulty
0,706670,FOREX : Learn Technical Analysis,1199.0,37.0,Mixed
1,1246622,Build and Deploy a LAMP server on AWS,3571.0,18.0,Beginner
2,795278,"Build Ajax Web Apps with Laravel 5.2, Bootstra...",1023.0,131.0,Mixed
3,646906,Playing Piano: Play Chords and Popular Pieces...,1987.0,7.0,Beginner
4,759972,150 Rock Guitar Licks You MUST Know,252.0,14.0,Mixed

In [33]:
coursera_df.to_sql(name='coursera', con=engine, if_exists='append', index=False)

In [34]:
pd.read_sql_query('select * from coursera', con=engine).head()

,course_id,course_title,course_students_enrolled,course_rating,course_difficulty
0,134,(ISC)² Systems Security Certified Practitioner...,5300.0,4.7,Beginner
1,743,A Crash Course in Causality: Inferring Causal...,17000.0,4.7,Intermediate
2,874,A Crash Course in Data Science,130000.0,4.5,Mixed
3,413,A Law Student's Toolkit,91000.0,4.7,Mixed
4,635,A Life of Happiness and Fulfillment,320000.0,4.8,Mixed

In [41]:
#query to know count of students enrolled in different difficulty levels
pd.read_sql_query('select course_difficulty,count(course_students_enrolled) from coursera group by (course_difficulty)', con=engine).head()

  course_difficulty  count
0      Intermediate    198
1          Beginner    487
2          Advanced     19
3             Mixed    187

In [42]:
pd.read_sql_query('select course_difficulty,count(course_students_enrolled) from udemy group by (course_difficulty)', con=engine).head()

  course_difficulty  count
0      Intermediate     88
1          Beginner    317
2          Advanced     17
3             Mixed    469

In [52]:
#query to find which course title has count of maximum students enrolled
pd.read_sql_query('select course_title,max(course_students_enrolled) from udemy group by (course_title) order by max(course_students_enrolled) desc', con=engine).head()

                                        course_title      max
0  Pianoforall - Incredible New Way To Learn Pian...  75499.0
1  Angular 4 (formerly Angular 2) - The Complete ...  73783.0
2               Beginner Photoshop to HTML5 and CSS3  73110.0
3  Web Development By Doing: HTML / CSS From Scratch  72932.0
4      Learn Responsive Web Development from Scratch  59639.0

In [43]:
#trying to merge data
data_merge = pd.merge(udemy_df, coursera_df, on="course_id")

In [53]:
#Load Cleaned Dataframes back into SQL
data_merge.to_sql(name='data_merge', con=engine, if_exists='append', index=False)

In [54]:
#Verify tables
engine.table_names()

['udemy', 'coursera', 'data_merge']